app/controllers/sorvetes_controller.rb

SELECT `sorvetes`.* FROM `sorvetes`
---
  def index
    @sorvetes = Sorvete.all

SELECT `sorvetes`.* FROM `sorvetes` WHERE `sorvetes`.`id` = 1 LIMIT 1
---
  def show
    @sorvete = Sorvete.find(params[:id])

INSERT INTO `sorvetes` (`cobertura`, `created_at`, `preco`, `sabor`, `updated_at`) VALUES (0, '2013-02-14 14:42:53', 2.0, 'Cogumelo', '2013-02-14 14:42:53')
---
  def create
    @sorvete = Sorvete.new(params[:sorvete])

    respond_to do |format|
      if @sorvete.save

SELECT `sorvetes`.* FROM `sorvetes` WHERE `sorvetes`.`id` = 1 LIMIT 1
DELETE FROM `sorvetes` WHERE `sorvetes`.`id` = 1
---
  def destroy
    @sorvete = Sorvete.find(params[:id])
    @sorvete.destroy